app/controllers/movies_controller.rb

    def index
      @title_style = ""
      @date_style = ""
      if params[:title_sort]
        @movies = Movie.order(:title)
        @title_style = "hilite p-3 mb-2 bg-warning"
      elsif params[:date_sort]
        @movies = Movie.order(:release_date)
        @date_style = "hilite p-3 mb-2 bg-warning"
      else
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies"